os/ext2-analysis.org
#+TITLE:     Ext2 File System Analysis
#+AUTHOR:    WANG Xiaolin
#+EMAIL:     wx672ster@gmail.com
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs2.swfu.edu.cn/org-info-js/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
# (setq org-export-html-use-infojs nil)

* FS Creation
  To create a 1M ext2 file system:
  - If you prefer =RAM disk=, do this:
    : sudo mount -t tmpfs -o size=2M tmpfs /mnt
    : cd /mnt
    : dd if=/dev/zero of=fs.img bs=1k count=1000
  - Or you can use a disk file directly
    : dd if=/dev/zero of=fs.img bs=1k count=1000
  - mke2fs
    : losetup /dev/loop0 fs.img
    : mke2fs /dev/loop0
    Or you can =mke2fs fs.img= directly
* Analysis
  : dumpe2fs fs.img
  : hexdump -C fs.img
** Block 0: Boot block
   - 00000000 - 000003ff
     - empty
