os/ext2-analysis.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ext2 File System Analysis</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Ext2 File System Analysis"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-17T21:30+0800"/>
<meta name="author" content="WANG Xiaolin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Ext2 File System Analysis</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 FS Creation</a></li>
<li><a href="#sec-2">2 Analysis</a>
<ul>
<li><a href="#sec-2-1">2.1 Block 0: Boot block</a></li>
<li><a href="#sec-2-2">2.2 Block 1: Superblock</a></li>
<li><a href="#sec-2-3">2.3 Block 2: group descriptor</a></li>
<li><a href="#sec-2-4">2.4 Block 3-5: Reserved GDT blocks</a></li>
<li><a href="#sec-2-5">2.5 Block 6: block bitmap</a></li>
<li><a href="#sec-2-6">2.6 Block 7: inode bitmap</a></li>
<li><a href="#sec-2-7">2.7 Block 8-23: inode table</a></li>
<li><a href="#sec-2-8">2.8 Block 24: data block for / dir</a>
<ul>
<li><a href="#sec-2-8-1">2.8.1 First entry in / dir: "."</a></li>
<li><a href="#sec-2-8-2">2.8.2 Second entry in / dir: ".."</a></li>
<li><a href="#sec-2-8-3">2.8.3 Third entry in / dir: "lost+found"</a></li>
<li><a href="#sec-2-8-4">2.8.4 Fourth entry in / dir: "hello"</a></li>
</ul>
</li>
<li><a href="#sec-2-9">2.9 Block 25-36: 12 data blocks for <code>/lost+found</code></a>
<ul>
<li><a href="#sec-2-9-1">2.9.1 First entry in <code>/lost+found</code> dir: "."</a></li>
<li><a href="#sec-2-9-2">2.9.2 Second entry in <code>/lost+found</code> dir: ".."</a></li>
</ul>
</li>
<li><a href="#sec-2-10">2.10 Block 38: data block for <code>hello</code></a></li>
</ul>
</li>
<li><a href="#sec-3">3 Finding a file</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> FS Creation</h2>
<div class="outline-text-2" id="text-1">

<p>  To create a 1M ext2 file system:
</p><ul>
<li>If you prefer <code>RAM disk</code>, do this:
<pre class="example">
sudo mount -t tmpfs -o size=2M tmpfs /mnt
cd /mnt
dd if=/dev/zero of=fs.img bs=1k count=1000
</pre>

</li>
<li>Or you can use a disk file directly
<pre class="example">
dd if=/dev/zero of=fs.img bs=1k count=1000
</pre>

</li>
<li>mke2fs
<pre class="example">
losetup /dev/loop0 fs.img
mke2fs /dev/loop0
</pre>

<p>    Or you can <code>mke2fs fs.img</code> directly
</p></li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Analysis</h2>
<div class="outline-text-2" id="text-2">

<pre class="example">
dumpe2fs fs.img
hexdump -C fs.img
</pre>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Block 0: Boot block</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>00000000 - 000003ff
<ul>
<li>empty
</li>
</ul>

</li>
</ul>

</div>

</div>
