os/ext2-analysis.org
** Block 1: Superblock
   - 00000400 - 000007ff
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+------+-------------------------------------------------+--------+------+---------------|
| size | start |  end | Superblock                                      |    Hex |  Dec |               |
|------+-------+------+-------------------------------------------------+--------+------+---------------|
|    4 |     1 |    4 | =Total number of inodes=                        |   0x80 |  128 |               |
|    4 |     5 |    8 | Filesystem size in blocks                       | 0x03e8 | 1000 |               |
|    4 |     9 |   12 | Number of reserved blocks                       |   0x32 |   50 |               |
|    4 |    13 |   16 | Free blocks counter                             | 0x03c2 |  962 |               |
|    4 |    17 |   20 | Free inodes counter                             |   0x75 |  117 |               |
|    4 |    21 |   24 | Number of first useful block (always 1)         |   0x01 |    1 |               |
|    4 |    25 |   28 | =Block size=                                    |      0 |    0 | =1024 << 0=   |
|    4 |    29 |   32 | Fragment size                                   |      0 |    0 |               |
|    4 |    33 |   36 | Number of blocks per group                      | 0x2000 | 8192 |               |
|    4 |    37 |   40 | Number of fragments per group                   | 0x2000 | 8192 |               |
|    4 |    41 |   44 | Number of inodes per group                      |   0x80 |  128 |               |
|    4 |    45 |   48 | Time of last mount operation                    |      0 |  n/a |               |
|    4 |    49 |   52 | Time of last write operation                    |        |      |               |
|    2 |    53 |   54 | Mount operations counter                        |      3 |    3 |               |
|    2 |    55 |   56 | Number of mount operations before check         | 0xffff |   -1 |               |
|    2 |    57 |   58 | Magic signature                                 | 0xef53 |      |               |
|    2 |    59 |   60 | Status flag                                     |      0 |    0 | not clean     |
|    2 |    61 |   62 | Behavior when detecting errors                  |      1 |      | continue      |
|    2 |    63 |   64 | Minor revision level                            |      0 |    0 |               |
|    4 |    65 |   68 | Time of last check                              |        |      |               |
|    4 |    69 |   72 | Time between checks                             |      0 |    0 | none          |
|    4 |    73 |   76 | OS where filesystem was created                 |      0 |    0 | linux         |
|    4 |    77 |   80 | Revision level                                  |      1 |    1 |               |
|    2 |    81 |   82 | Default user ID for reserved blocks             |      0 |    0 | root          |
|    2 |    83 |   84 | Default group ID for reserved blocks            |      0 |    0 | root          |
|    4 |    85 |   88 | Number of first nonreserved inode               |   0x0b |   11 |               |
|    2 |    89 |   90 | =Size of on-disk inode structure=               |   0x80 |  128 |               |
|    2 |    91 |   92 | Block group number of this superblock           |      0 |    0 |               |
|    4 |    93 |   96 | Compatible features bitmap                      |        |      |               |
|    4 |    97 |  100 | Incompatible features bitmap                    |        |      |               |
|    4 |   101 |  104 | Read-only-compatible features bitmap            |        |      |               |
|   16 |   105 |  120 | 128-bit filesystem identifier                   |        |      |               |
|   16 |   121 |  136 | Volume name                                     |      0 |    0 | none          |
|   64 |   137 |  200 | Path of last mount point                        |      0 |    0 | not available |
|    4 |   201 |  204 | Used for compression                            |        |      |               |
|    1 |   205 |  205 | Number of blocks to preallocate                 |      0 |    0 |               |
|    1 |   206 |  206 | Number of blocks to preallocate for directories |      3 |    3 |               |
|  818 |   207 | 1024 | Nulls to pad out 1024 bytes                     |        |      |               |
|------+-------+------+-------------------------------------------------+--------+------+---------------|

