os/ext2-analysis.html

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Block 1: Superblock</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>00000400 - 000007ff
</li>
</ul>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Superblock</th><th scope="col" class="right">Hex</th><th scope="col" class="right">Dec</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">1</td><td class="right">4</td><td class="left"><code>Total number of inodes</code></td><td class="right">0x80</td><td class="right">128</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">5</td><td class="right">8</td><td class="left">Filesystem size in blocks</td><td class="right">0x03e8</td><td class="right">1000</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">9</td><td class="right">12</td><td class="left">Number of reserved blocks</td><td class="right">0x32</td><td class="right">50</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">13</td><td class="right">16</td><td class="left">Free blocks counter</td><td class="right">0x03c2</td><td class="right">962</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">17</td><td class="right">20</td><td class="left">Free inodes counter</td><td class="right">0x75</td><td class="right">117</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">21</td><td class="right">24</td><td class="left">Number of first useful block (always 1)</td><td class="right">0x01</td><td class="right">1</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">25</td><td class="right">28</td><td class="left"><code>Block size</code></td><td class="right">0</td><td class="right">0</td><td class="left"><code>1024 &lt;&lt; 0</code></td></tr>
<tr><td class="right">4</td><td class="right">29</td><td class="right">32</td><td class="left">Fragment size</td><td class="right">0</td><td class="right">0</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">33</td><td class="right">36</td><td class="left">Number of blocks per group</td><td class="right">0x2000</td><td class="right">8192</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">37</td><td class="right">40</td><td class="left">Number of fragments per group</td><td class="right">0x2000</td><td class="right">8192</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">41</td><td class="right">44</td><td class="left">Number of inodes per group</td><td class="right">0x80</td><td class="right">128</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">45</td><td class="right">48</td><td class="left">Time of last mount operation</td><td class="right">0</td><td class="right">n/a</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">49</td><td class="right">52</td><td class="left">Time of last write operation</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">53</td><td class="right">54</td><td class="left">Mount operations counter</td><td class="right">3</td><td class="right">3</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">55</td><td class="right">56</td><td class="left">Number of mount operations before check</td><td class="right">0xffff</td><td class="right">-1</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">57</td><td class="right">58</td><td class="left">Magic signature</td><td class="right">0xef53</td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">59</td><td class="right">60</td><td class="left">Status flag</td><td class="right">0</td><td class="right">0</td><td class="left">not clean</td></tr>
<tr><td class="right">2</td><td class="right">61</td><td class="right">62</td><td class="left">Behavior when detecting errors</td><td class="right">1</td><td class="right"></td><td class="left">continue</td></tr>
<tr><td class="right">2</td><td class="right">63</td><td class="right">64</td><td class="left">Minor revision level</td><td class="right">0</td><td class="right">0</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">65</td><td class="right">68</td><td class="left">Time of last check</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">69</td><td class="right">72</td><td class="left">Time between checks</td><td class="right">0</td><td class="right">0</td><td class="left">none</td></tr>
<tr><td class="right">4</td><td class="right">73</td><td class="right">76</td><td class="left">OS where filesystem was created</td><td class="right">0</td><td class="right">0</td><td class="left">linux</td></tr>
<tr><td class="right">4</td><td class="right">77</td><td class="right">80</td><td class="left">Revision level</td><td class="right">1</td><td class="right">1</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">81</td><td class="right">82</td><td class="left">Default user ID for reserved blocks</td><td class="right">0</td><td class="right">0</td><td class="left">root</td></tr>
<tr><td class="right">2</td><td class="right">83</td><td class="right">84</td><td class="left">Default group ID for reserved blocks</td><td class="right">0</td><td class="right">0</td><td class="left">root</td></tr>
<tr><td class="right">4</td><td class="right">85</td><td class="right">88</td><td class="left">Number of first nonreserved inode</td><td class="right">0x0b</td><td class="right">11</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">89</td><td class="right">90</td><td class="left"><code>Size of on-disk inode structure</code></td><td class="right">0x80</td><td class="right">128</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">91</td><td class="right">92</td><td class="left">Block group number of this superblock</td><td class="right">0</td><td class="right">0</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">93</td><td class="right">96</td><td class="left">Compatible features bitmap</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">97</td><td class="right">100</td><td class="left">Incompatible features bitmap</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">101</td><td class="right">104</td><td class="left">Read-only-compatible features bitmap</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">16</td><td class="right">105</td><td class="right">120</td><td class="left">128-bit filesystem identifier</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">16</td><td class="right">121</td><td class="right">136</td><td class="left">Volume name</td><td class="right">0</td><td class="right">0</td><td class="left">none</td></tr>
<tr><td class="right">64</td><td class="right">137</td><td class="right">200</td><td class="left">Path of last mount point</td><td class="right">0</td><td class="right">0</td><td class="left">not available</td></tr>
<tr><td class="right">4</td><td class="right">201</td><td class="right">204</td><td class="left">Used for compression</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">205</td><td class="right">205</td><td class="left">Number of blocks to preallocate</td><td class="right">0</td><td class="right">0</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">206</td><td class="right">206</td><td class="left">Number of blocks to preallocate for directories</td><td class="right">3</td><td class="right">3</td><td class="left"></td></tr>
<tr><td class="right">818</td><td class="right">207</td><td class="right">1024</td><td class="left">Nulls to pad out 1024 bytes</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
</tbody>
</table>


</div>

</div>
