os/ext2-analysis.org
** Block 2: group descriptor
   - 00000800 - 00000bff
#+ATTR_HTML: border="2" rules="all" frame="border"        
|------+-------+-----+-----------------------------------------+--------+-----|
| size | start | end | Group Descriptor                        |    hex | dec |
|------+-------+-----+-----------------------------------------+--------+-----|
|    4 |     1 |   4 | Block number of block bitmap            |      6 |   6 |
|    4 |     5 |   8 | Block number of inode bitmap            |      7 |   7 |
|    4 |     9 |  12 | Block number of first inode table block |      8 |   8 |
|    2 |    13 |  14 | Number of free blocks in the group      | 0x03c2 | 962 |
|    2 |    15 |  16 | Number of free inodes in the group      |   0x75 | 117 |
|    2 |    17 |  18 | Number of directories in the group      |      2 |   2 |
|    2 |    19 |  20 | Alignment to word                       |        |     |
|    4 |    21 |  24 | Nulls to pad out 24 bytes               |        |     |
|------+-------+-----+-----------------------------------------+--------+-----|
** Block 3-5: Reserved GDT blocks
   - 00000c00 - 000017ff
** Block 6: block bitmap
   - 00001800 - 00001bff
** Block 7: inode bitmap
   - 00001c00 - 00001fff
