os/ext2-analysis.html

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Block 2: group descriptor</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>00000800 - 00000bff
</li>
</ul>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Group Descriptor</th><th scope="col" class="right">hex</th><th scope="col" class="right">dec</th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">1</td><td class="right">4</td><td class="left">Block number of block bitmap</td><td class="right">6</td><td class="right">6</td></tr>
<tr><td class="right">4</td><td class="right">5</td><td class="right">8</td><td class="left">Block number of inode bitmap</td><td class="right">7</td><td class="right">7</td></tr>
<tr><td class="right">4</td><td class="right">9</td><td class="right">12</td><td class="left">Block number of first inode table block</td><td class="right">8</td><td class="right">8</td></tr>
<tr><td class="right">2</td><td class="right">13</td><td class="right">14</td><td class="left">Number of free blocks in the group</td><td class="right">0x03c2</td><td class="right">962</td></tr>
<tr><td class="right">2</td><td class="right">15</td><td class="right">16</td><td class="left">Number of free inodes in the group</td><td class="right">0x75</td><td class="right">117</td></tr>
<tr><td class="right">2</td><td class="right">17</td><td class="right">18</td><td class="left">Number of directories in the group</td><td class="right">2</td><td class="right">2</td></tr>
<tr><td class="right">2</td><td class="right">19</td><td class="right">20</td><td class="left">Alignment to word</td><td class="right"></td><td class="right"></td></tr>
<tr><td class="right">4</td><td class="right">21</td><td class="right">24</td><td class="left">Nulls to pad out 24 bytes</td><td class="right"></td><td class="right"></td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Block 3-5: Reserved GDT blocks</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>00000c00 - 000017ff
</li>
</ul>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Block 6: block bitmap</h3>
<div class="outline-text-3" id="text-2-5">

<ul>
<li>00001800 - 00001bff
</li>
</ul>

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Block 7: inode bitmap</h3>
<div class="outline-text-3" id="text-2-6">

<ul>
<li>00001c00 - 00001fff
</li>
</ul>

</div>

</div>
