os/ext2-analysis.org
** Block 8-23: inode table
   00002000 - 00005fff
   - inode 0: deleted file
     - nil
   - inode 1: /proc, /sys...
     - 00002000 - 0000207f
   - inode 2: /
     - 00002080 - 000020ff
#+CAPTION: inode 2: root inode
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+---------------------------------------+--------+------+-----------|
| size | start | end | Inode                                 |    Hex |  Dec |           |
|------+-------+-----+---------------------------------------+--------+------+-----------|
|    2 |     1 |   2 | File type and access rights           | 0x41ed |      |           |
|    2 |     3 |   4 | Owner identification                  | 0x03e8 | 1000 | UID       |
|    4 |     5 |   8 | =File length in bytes=                | 0x0400 | 1024 |           |
|    4 |     9 |  12 | Time of last file access              |        |      |           |
|    4 |    13 |  16 | Time that inode last changed          |        |      |           |
|    4 |    17 |  20 | Time that file contents last changed  |        |      |           |
|    4 |    21 |  24 | Time of file deletion                 |      0 |      |           |
|    2 |    25 |  26 | Group identifier                      | 0x03e8 | 1000 | GID       |
|    2 |    27 |  28 | Hard links counter                    |      3 |    3 |           |
|    4 |    29 |  32 | =Number of data blocks of the file=   |      2 |    2 | 512-block |
|    4 |    33 |  36 | File flags                            |      0 |      |           |
|    4 |    37 |  40 | Specific operating system information |      0 |      |           |
|    4 |    41 |  44 | =Pointer to first data block=         |   0x18 |   24 |           |
|   56 |    45 | 100 | 14 more pointers to data blocks       |      0 |      |           |
|    4 |   101 | 104 | File version (for NFS)                |        |      |           |
|    4 |   105 | 108 | File access control list              |        |      |           |
|    4 |   109 | 112 | Directory access control list         |        |      |           |
|    4 |   113 | 116 | Fragment address                      |        |      |           |
|    8 |   117 | 124 | Specific operating system information |        |      |           |
|------+-------+-----+---------------------------------------+--------+------+-----------|
   - inode 11: =/lost+found=
     - 00002500 - 0000257f
       
#+CAPTION: inode 11: lost+found
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+---------------------------------------+--------+-------+-------------|
| size | start | end | Inode                                 |    Hex |   Dec |             |
|------+-------+-----+---------------------------------------+--------+-------+-------------|
|    2 |     1 |   2 | File type and access rights           | 0x41c0 |       |             |
|    2 |     3 |   4 | Owner identification                  |      0 |     0 | root        |
|    4 |     5 |   8 | =File length in bytes=                | 0x3000 | 12288 |             |
|    4 |     9 |  12 | Time of last file access              |        |       |             |
|    4 |    13 |  16 | Time that inode last changed          |        |       |             |
|    4 |    17 |  20 | Time that file contents last changed  |        |       |             |
|    4 |    21 |  24 | Time of file deletion                 |      0 |       |             |
|    2 |    25 |  26 | Group identifier                      |      0 |     0 | root        |
|    2 |    27 |  28 | Hard links counter                    |      2 |     2 |             |
|    4 |    29 |  32 | =Number of data blocks of the file=   |   0x18 |    24 | 512-block   |
|    4 |    33 |  36 | File flags                            |      0 |       |             |
|    4 |    37 |  40 | Specific operating system information |      0 |       |             |
|    4 |    41 |  44 | =Pointer to first data block=         |   0x19 |    25 |             |
|   56 |    45 | 100 | 14 more pointers to data blocks       |  1a-24 | 26-36 | 11 pointers |
|    4 |   101 | 104 | File version (for NFS)                |        |       |             |
|    4 |   105 | 108 | File access control list              |        |       |             |
|    4 |   109 | 112 | Directory access control list         |        |       |             |
|    4 |   113 | 116 | Fragment address                      |        |       |             |
|    8 |   117 | 124 | Specific operating system information |        |       |             |
|------+-------+-----+---------------------------------------+--------+-------+-------------|
   - inode 12: =hello=
     - 00002580 - 00002600
#+CAPTION: inode 12: hello
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+---------------------------------------+--------+------+------------------|
| size | start | end | Inode                                 |    Hex |  Dec |                  |
|------+-------+-----+---------------------------------------+--------+------+------------------|
|    2 |     1 |   2 | File type and access rights           | 0x81a4 |      |                  |
|    2 |     3 |   4 | Owner identification                  |   03e8 | 1000 | wx672            |
|    4 |     5 |   8 | File length in bytes                  |      a |   10 |                  |
|    4 |     9 |  12 | Time of last file access              |        |      |                  |
|    4 |    13 |  16 | Time that inode last changed          |        |      |                  |
|    4 |    17 |  20 | Time that file contents last changed  |        |      |                  |
|    4 |    21 |  24 | Time of file deletion                 |      0 |      |                  |
|    2 |    25 |  26 | Group identifier                      |   03e8 | 1000 | wx672            |
|    2 |    27 |  28 | Hard links counter                    |      1 |      |                  |
|    4 |    29 |  32 | Number of data blocks of the file     |      2 |      | 512-block        |
|    4 |    33 |  36 | File flags                            |      0 |      |                  |
|    4 |    37 |  40 | Specific operating system information |      0 |      |                  |
|    4 |    41 |  44 | Pointer to first data block           |   0x26 |   38 | 0x00009800       |
|   56 |    45 | 100 | 14 more pointers to data blocks       |        |      |                  |
|    4 |   101 | 104 | File version (for NFS)                |        |      |                  |
|    4 |   105 | 108 | File access control list              |        |      |                  |
|    4 |   109 | 112 | Directory access control list         |        |      | =for large file= |
|    4 |   113 | 116 | Fragment address                      |        |      |                  |
|    8 |   117 | 124 | Specific operating system information |        |      |                  |
|------+-------+-----+---------------------------------------+--------+------+------------------|
       
