os/ext2-analysis.html

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Block 8-23: inode table</h3>
<div class="outline-text-3" id="text-2-7">

<p>   00002000 - 00005fff
</p><ul>
<li>inode 0: deleted file
<ul>
<li>nil
</li>
</ul>

</li>
<li>inode 1: /proc, /sys&hellip;
<ul>
<li>00002000 - 0000207f
</li>
</ul>

</li>
<li>inode 2: /
<ul>
<li>00002080 - 000020ff
</li>
</ul>

</li>
</ul>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption>inode 2: root inode</caption>
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Inode</th><th scope="col" class="right">Hex</th><th scope="col" class="left">Dec</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">2</td><td class="right">1</td><td class="right">2</td><td class="left">File type and access rights</td><td class="right">0x41ed</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">3</td><td class="right">4</td><td class="left">Owner identification</td><td class="right">0x03e8</td><td class="left">1000</td><td class="left">UID</td></tr>
<tr><td class="right">4</td><td class="right">5</td><td class="right">8</td><td class="left"><code>File length in bytes</code></td><td class="right">0x0400</td><td class="left">1024</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">9</td><td class="right">12</td><td class="left">Time of last file access</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">13</td><td class="right">16</td><td class="left">Time that inode last changed</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">17</td><td class="right">20</td><td class="left">Time that file contents last changed</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">21</td><td class="right">24</td><td class="left">Time of file deletion</td><td class="right">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">25</td><td class="right">26</td><td class="left">Group identifier</td><td class="right">0x03e8</td><td class="left">1000</td><td class="left">GID</td></tr>
<tr><td class="right">2</td><td class="right">27</td><td class="right">28</td><td class="left">Hard links counter</td><td class="right">3</td><td class="left">3</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">29</td><td class="right">32</td><td class="left"><code>Number of data blocks of the file</code></td><td class="right">2</td><td class="left">2</td><td class="left">512-block</td></tr>
<tr><td class="right">4</td><td class="right">33</td><td class="right">36</td><td class="left">File flags</td><td class="right">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">37</td><td class="right">40</td><td class="left">Specific operating system information</td><td class="right">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">41</td><td class="right">44</td><td class="left"><code>Pointer to first data block</code></td><td class="right">0x18</td><td class="left">24</td><td class="left"></td></tr>
<tr><td class="right">56</td><td class="right">45</td><td class="right">100</td><td class="left">14 more pointers to data blocks</td><td class="right">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">101</td><td class="right">104</td><td class="left">File version (for NFS)</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">105</td><td class="right">108</td><td class="left">File access control list</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">109</td><td class="right">112</td><td class="left">Directory access control list</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">113</td><td class="right">116</td><td class="left">Fragment address</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">8</td><td class="right">117</td><td class="right">124</td><td class="left">Specific operating system information</td><td class="right"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>

<ul>
<li>inode 11: <code>/lost+found</code>
<ul>
<li>00002500 - 0000257f
</li>
</ul>

</li>
</ul>


<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption>inode 11: lost+found</caption>
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Inode</th><th scope="col" class="left">Hex</th><th scope="col" class="left">Dec</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">2</td><td class="right">1</td><td class="right">2</td><td class="left">File type and access rights</td><td class="left">0x41c0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">3</td><td class="right">4</td><td class="left">Owner identification</td><td class="left">0</td><td class="left">0</td><td class="left">root</td></tr>
<tr><td class="right">4</td><td class="right">5</td><td class="right">8</td><td class="left"><code>File length in bytes</code></td><td class="left">0x3000</td><td class="left">12288</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">9</td><td class="right">12</td><td class="left">Time of last file access</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">13</td><td class="right">16</td><td class="left">Time that inode last changed</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">17</td><td class="right">20</td><td class="left">Time that file contents last changed</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">21</td><td class="right">24</td><td class="left">Time of file deletion</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">25</td><td class="right">26</td><td class="left">Group identifier</td><td class="left">0</td><td class="left">0</td><td class="left">root</td></tr>
<tr><td class="right">2</td><td class="right">27</td><td class="right">28</td><td class="left">Hard links counter</td><td class="left">2</td><td class="left">2</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">29</td><td class="right">32</td><td class="left"><code>Number of data blocks of the file</code></td><td class="left">0x18</td><td class="left">24</td><td class="left">512-block</td></tr>
<tr><td class="right">4</td><td class="right">33</td><td class="right">36</td><td class="left">File flags</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">37</td><td class="right">40</td><td class="left">Specific operating system information</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">41</td><td class="right">44</td><td class="left"><code>Pointer to first data block</code></td><td class="left">0x19</td><td class="left">25</td><td class="left"></td></tr>
<tr><td class="right">56</td><td class="right">45</td><td class="right">100</td><td class="left">14 more pointers to data blocks</td><td class="left">1a-24</td><td class="left">26-36</td><td class="left">11 pointers</td></tr>
<tr><td class="right">4</td><td class="right">101</td><td class="right">104</td><td class="left">File version (for NFS)</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">105</td><td class="right">108</td><td class="left">File access control list</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">109</td><td class="right">112</td><td class="left">Directory access control list</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">113</td><td class="right">116</td><td class="left">Fragment address</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">8</td><td class="right">117</td><td class="right">124</td><td class="left">Specific operating system information</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>

<ul>
<li>inode 12: <code>hello</code>
<ul>
<li>00002580 - 00002600
</li>
</ul>

</li>
</ul>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption>inode 12: hello</caption>
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Inode</th><th scope="col" class="left">Hex</th><th scope="col" class="left">Dec</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">2</td><td class="right">1</td><td class="right">2</td><td class="left">File type and access rights</td><td class="left">0x81a4</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">3</td><td class="right">4</td><td class="left">Owner identification</td><td class="left">03e8</td><td class="left">1000</td><td class="left">wx672</td></tr>
<tr><td class="right">4</td><td class="right">5</td><td class="right">8</td><td class="left">File length in bytes</td><td class="left">a</td><td class="left">10</td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">9</td><td class="right">12</td><td class="left">Time of last file access</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">13</td><td class="right">16</td><td class="left">Time that inode last changed</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">17</td><td class="right">20</td><td class="left">Time that file contents last changed</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">21</td><td class="right">24</td><td class="left">Time of file deletion</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">25</td><td class="right">26</td><td class="left">Group identifier</td><td class="left">03e8</td><td class="left">1000</td><td class="left">wx672</td></tr>
<tr><td class="right">2</td><td class="right">27</td><td class="right">28</td><td class="left">Hard links counter</td><td class="left">1</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">29</td><td class="right">32</td><td class="left">Number of data blocks of the file</td><td class="left">2</td><td class="left"></td><td class="left">512-block</td></tr>
<tr><td class="right">4</td><td class="right">33</td><td class="right">36</td><td class="left">File flags</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">37</td><td class="right">40</td><td class="left">Specific operating system information</td><td class="left">0</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">41</td><td class="right">44</td><td class="left">Pointer to first data block</td><td class="left">0x26</td><td class="left">38</td><td class="left">0x00009800</td></tr>
<tr><td class="right">56</td><td class="right">45</td><td class="right">100</td><td class="left">14 more pointers to data blocks</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">101</td><td class="right">104</td><td class="left">File version (for NFS)</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">105</td><td class="right">108</td><td class="left">File access control list</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">4</td><td class="right">109</td><td class="right">112</td><td class="left">Directory access control list</td><td class="left"></td><td class="left"></td><td class="left"><code>for large file</code></td></tr>
<tr><td class="right">4</td><td class="right">113</td><td class="right">116</td><td class="left">Fragment address</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="right">8</td><td class="right">117</td><td class="right">124</td><td class="left">Specific operating system information</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>


</div>

</div>
