os/ext2-analysis.org
** Block 24: data block for / dir
   - 00006000 - 000063ff
*** First entry in / dir: "."      
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+-----+-----|
| size | start | end | Directory Entry               | hex |     |
|------+-------+-----+-------------------------------+-----+-----|
|    4 |     1 |   4 | Inode number                  |   2 |     |
|    2 |     5 |   6 | This directory entry's length |   c |     |
|    1 |     7 |   7 | File name length              |   1 |     |
|    1 |     8 |   8 | File type                     |   2 | dir |
|    x |     9 |   x | File name                     |  2e | .   |
|------+-------+-----+-------------------------------+-----+-----|
*** Second entry in / dir: ".."    
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+------+-----|
| size | start | end | Directory Entry               |  hex |     |
|------+-------+-----+-------------------------------+------+-----|
|    4 |    12 |  15 | Inode number                  |    2 |     |
|    2 |    16 |  17 | This directory entry's length |    c | 12  |
|    1 |    18 |  18 | File name length              |    2 |     |
|    1 |    19 |  19 | File type                     |    2 | dir |
|    x |    21 |   x | File name                     | 2e2e | ..  |
|------+-------+-----+-------------------------------+------+-----|
*** Third entry in / dir: "lost+found"
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+-----+------------|
| size | start | end | Directory Entry               | hex |            |
|------+-------+-----+-------------------------------+-----+------------|
|    4 |    25 |  28 | Inode number                  | b   |         11 |
|    2 |    29 |  30 | This directory entry's length | 14  |         20 |
|    1 |    31 |  31 | File name length              | a   |         10 |
|    1 |    32 |  32 | File type                     | 2   |        dir |
|    x |    33 |   x | File name                     |     | lost+found |
|------+-------+-----+-------------------------------+-----+------------|
*** Fourth entry in / dir: "hello"
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+------+---------|
| size | start | end | Directory Entry               |  hex |         |
|------+-------+-----+-------------------------------+------+---------|
|    4 |    45 |  48 | Inode number                  |    c |      12 |
|    2 |    49 |  50 | This directory entry's length | 03d4 |     980 |
|    1 |    51 |  51 | File name length              |    5 |       5 |
|    1 |    52 |  52 | File type                     |    1 | regular |
|    x |    53 |   x | File name                     |      |   hello |
|------+-------+-----+-------------------------------+------+---------|

** Block 25-36: 12 data blocks for =/lost+found=
   - 00006400 - 00008fff
*** First entry in =/lost+found= dir: "."     
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+-----+-----|
| size | start | end | Directory Entry               | hex |     |
|------+-------+-----+-------------------------------+-----+-----|
|    4 |     1 |   4 | Inode number                  |   b |     |
|    2 |     5 |   6 | This directory entry's length |   c |     |
|    1 |     7 |   7 | File name length              |   1 |     |
|    1 |     8 |   8 | File type                     |   2 | dir |
|    x |     9 |   x | File name                     |  2e | .   |
|------+-------+-----+-------------------------------+-----+-----|
*** Second entry in =/lost+found= dir: ".."     
#+ATTR_HTML: border="2" rules="all" frame="border"   
|------+-------+-----+-------------------------------+------+------|
| size | start | end | Directory Entry               |  hex |      |
|------+-------+-----+-------------------------------+------+------|
|    4 |    12 |  15 | Inode number                  |    2 |      |
|    2 |    16 |  17 | This directory entry's length | 03f4 | 1012 |
|    1 |    18 |  18 | File name length              |    2 |      |
|    1 |    19 |  19 | File type                     |    2 | dir  |
|    x |    21 |   x | File name                     | 2e2e | ..   |
|------+-------+-----+-------------------------------+------+------|
** Block 38: data block for =hello=
   - 00009800 - 00009cff

     helloworld
     
