os/ext2-analysis.html

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Block 24: data block for / dir</h3>
<div class="outline-text-3" id="text-2-8">

<ul>
<li>00006000 - 000063ff
</li>
</ul>


</div>

<div id="outline-container-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> First entry in / dir: "."</h4>
<div class="outline-text-4" id="text-2-8-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="right">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">1</td><td class="right">4</td><td class="left">Inode number</td><td class="right">2</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">5</td><td class="right">6</td><td class="left">This directory entry's length</td><td class="right">c</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">7</td><td class="right">7</td><td class="left">File name length</td><td class="right">1</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">8</td><td class="right">8</td><td class="left">File type</td><td class="right">2</td><td class="left">dir</td></tr>
<tr><td class="right">x</td><td class="right">9</td><td class="right">x</td><td class="left">File name</td><td class="right">2e</td><td class="left">.</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-8-2" class="outline-4">
<h4 id="sec-2-8-2"><span class="section-number-4">2.8.2</span> Second entry in / dir: ".."</h4>
<div class="outline-text-4" id="text-2-8-2">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="right">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">12</td><td class="right">15</td><td class="left">Inode number</td><td class="right">2</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">16</td><td class="right">17</td><td class="left">This directory entry's length</td><td class="right">c</td><td class="left">12</td></tr>
<tr><td class="right">1</td><td class="right">18</td><td class="right">18</td><td class="left">File name length</td><td class="right">2</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">19</td><td class="right">19</td><td class="left">File type</td><td class="right">2</td><td class="left">dir</td></tr>
<tr><td class="right">x</td><td class="right">21</td><td class="right">x</td><td class="left">File name</td><td class="right">2e2e</td><td class="left">..</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-8-3" class="outline-4">
<h4 id="sec-2-8-3"><span class="section-number-4">2.8.3</span> Third entry in / dir: "lost+found"</h4>
<div class="outline-text-4" id="text-2-8-3">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="left">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">25</td><td class="right">28</td><td class="left">Inode number</td><td class="left">b</td><td class="left">11</td></tr>
<tr><td class="right">2</td><td class="right">29</td><td class="right">30</td><td class="left">This directory entry's length</td><td class="left">14</td><td class="left">20</td></tr>
<tr><td class="right">1</td><td class="right">31</td><td class="right">31</td><td class="left">File name length</td><td class="left">a</td><td class="left">10</td></tr>
<tr><td class="right">1</td><td class="right">32</td><td class="right">32</td><td class="left">File type</td><td class="left">2</td><td class="left">dir</td></tr>
<tr><td class="right">x</td><td class="right">33</td><td class="right">x</td><td class="left">File name</td><td class="left"></td><td class="left">lost+found</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-8-4" class="outline-4">
<h4 id="sec-2-8-4"><span class="section-number-4">2.8.4</span> Fourth entry in / dir: "hello"</h4>
<div class="outline-text-4" id="text-2-8-4">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="left">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">45</td><td class="right">48</td><td class="left">Inode number</td><td class="left">c</td><td class="left">12</td></tr>
<tr><td class="right">2</td><td class="right">49</td><td class="right">50</td><td class="left">This directory entry's length</td><td class="left">03d4</td><td class="left">980</td></tr>
<tr><td class="right">1</td><td class="right">51</td><td class="right">51</td><td class="left">File name length</td><td class="left">5</td><td class="left">5</td></tr>
<tr><td class="right">1</td><td class="right">52</td><td class="right">52</td><td class="left">File type</td><td class="left">1</td><td class="left">regular</td></tr>
<tr><td class="right">x</td><td class="right">53</td><td class="right">x</td><td class="left">File name</td><td class="left"></td><td class="left">hello</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Block 25-36: 12 data blocks for <code>/lost+found</code></h3>
<div class="outline-text-3" id="text-2-9">

<ul>
<li>00006400 - 00008fff
</li>
</ul>


</div>

<div id="outline-container-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> First entry in <code>/lost+found</code> dir: "."</h4>
<div class="outline-text-4" id="text-2-9-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="left">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">1</td><td class="right">4</td><td class="left">Inode number</td><td class="left">b</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">5</td><td class="right">6</td><td class="left">This directory entry's length</td><td class="left">c</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">7</td><td class="right">7</td><td class="left">File name length</td><td class="left">1</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">8</td><td class="right">8</td><td class="left">File type</td><td class="left">2</td><td class="left">dir</td></tr>
<tr><td class="right">x</td><td class="right">9</td><td class="right">x</td><td class="left">File name</td><td class="left">2e</td><td class="left">.</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> Second entry in <code>/lost+found</code> dir: ".."</h4>
<div class="outline-text-4" id="text-2-9-2">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">size</th><th scope="col" class="right">start</th><th scope="col" class="right">end</th><th scope="col" class="left">Directory Entry</th><th scope="col" class="right">hex</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="right">4</td><td class="right">12</td><td class="right">15</td><td class="left">Inode number</td><td class="right">2</td><td class="left"></td></tr>
<tr><td class="right">2</td><td class="right">16</td><td class="right">17</td><td class="left">This directory entry's length</td><td class="right">03f4</td><td class="left">1012</td></tr>
<tr><td class="right">1</td><td class="right">18</td><td class="right">18</td><td class="left">File name length</td><td class="right">2</td><td class="left"></td></tr>
<tr><td class="right">1</td><td class="right">19</td><td class="right">19</td><td class="left">File type</td><td class="right">2</td><td class="left">dir</td></tr>
<tr><td class="right">x</td><td class="right">21</td><td class="right">x</td><td class="left">File name</td><td class="right">2e2e</td><td class="left">..</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Block 38: data block for <code>hello</code></h3>
<div class="outline-text-3" id="text-2-10">

<ul>
<li>00009800 - 00009cff

<p>
     helloworld
</p></li>
</ul>


</div>
</div>

</div>
