os/ext2-analysis.org
* Finding a file
  First, let's create a small text file named 'hello':
  1. Mount =fs.img= on =/mnt=
     : sudo mount -o loop fs.img /mnt
  2. Create a simple 10-byte text file named =hello= in =/mnt=
     : echo -n "helloworld" > /mnt/hello
  Now let's try finding it in =fs.img= by means of =hexdump=:
  : hexdump -C fs.img
  To find a file in ext2 file system, we need to go through the following steps:
  - finding the inode table :: We already know that the inode table is located in block
       8-23 (=00002000 - 00005fff=).
  - finding the root inode :: We already know that the root inode is at =00002080 -
       000020ff=
  - finding the inode of =hello= :: At address =0000602c=, you can see the inode number
       of file =hello= is =0x0c=, that's a decimal 12. Or you can use 
       : ls -il /mnt/hello
       to see it. In =fs.img= inode 12 is at =00002580 - 00002600=
  - finding the data blocks of the file :: At address =000025a8= you can see the data
       block number of the file is =0x26=, 38 in decimal. The 38th block in =fs.img= is at
       =00009800=. You can find "helloworld" there!
     
     
