os/ext2-analysis.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Finding a file</h2>
<div class="outline-text-2" id="text-3">

<p>  First, let's create a small text file named 'hello':
</p><ol>
<li>Mount <code>fs.img</code> on <code>/mnt</code>
<pre class="example">
sudo mount -o loop fs.img /mnt
</pre>

</li>
<li>Create a simple 10-byte text file named <code>hello</code> in <code>/mnt</code>
<pre class="example">
echo -n "helloworld" &gt; /mnt/hello
</pre>

</li>
</ol>

<p>  Now let's try finding it in <code>fs.img</code> by means of <code>hexdump</code>:
</p><pre class="example">
hexdump -C fs.img
</pre>

<p>  To find a file in ext2 file system, we need to go through the following steps:
</p><dl>
<dt>finding the inode table</dt><dd>We already know that the inode table is located in block
       8-23 (<code>00002000 - 00005fff</code>).
</dd>
<dt>finding the root inode</dt><dd>We already know that the root inode is at <code>00002080 -        000020ff</code>
</dd>
<dt>finding the inode of <code>hello</code></dt><dd>At address <code>0000602c</code>, you can see the inode number
       of file <code>hello</code> is <code>0x0c</code>, that's a decimal 12. Or you can use 
<pre class="example">
ls -il /mnt/hello
</pre>

<p>       to see it. In <code>fs.img</code> inode 12 is at <code>00002580 - 00002600</code>
</p></dd>
<dt>finding the data blocks of the file</dt><dd>At address <code>000025a8</code> you can see the data
       block number of the file is <code>0x26</code>, 38 in decimal. The 38th block in <code>fs.img</code> is at
       <code>00009800</code>. You can find "helloworld" there!
</dd>
</dl>



</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: WANG Xiaolin (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2013-11-17T21:30+0800</p>

</div>
</body>
</html>
